#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>
//int main()
//{
//	//大小端介绍
//	//大端（存储）模式，是指数据的低位保存在内存的高地址中，而数据的高位，保存在内存的低地址中。
//	//小端（存储）模式，是指数据的低位保存在内存的低地址中，而数据的高位，保存在内存的高地址中。
//	return 0;
//}


//百度2015年系统工程师笔试题：
//请简述大端字节序和小端字节序的概念，设计一个小程序来判断当前机器的字节序。（10分）
//int check_sys()
//{
//	int a = 1;
//	char* pc = (char*)&a;
//	if (*pc == 0)
//	{
//		return 0;
//	}
//	else
//	{
//		return 1;
//	}
//	//return (*(char*)&a);
//}
//int main()
//{
//	//返回1 小端
//	//返回0 大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}


//1.
//输出什么？
//考点：有符号 无符号 整形提升 符号位为1 补1 符号位为0 补0
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001	源码
//	//11111111111111111111111111111110	反码
//	//11111111111111111111111111111111	补码
//	//11111111	char类型的a在内存中真正的存储
//	//11111111111111111111111111111111	以整形打印(打印源码) 要整形提升 符号位为1 补1
//	
//	signed char b = -1;
//	//11111111
//	//11111111111111111111111111111111	以有符号整形打印 整形提升
//	unsigned char c = -1;
//	//11111111
//	//00000000000000000000000011111111	以无符号整形打印 整形提升 符号位为0 补0
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	//		  -1   -1	255
//	return 0;
//}


//2.
//int main()
//{
//	char a = -128;
//	//char a = 128;//128=127+1=-128
//	//10000000000000000000000010000000	源码
//	//11111111111111111111111101111111	反码
//	//11111111111111111111111110000000	补码
//	//10000000
//	//11111111111111111111111110000000	整形提升 符号位为1 补1
//	printf("%u\n", a);
//	//4294967168
//	//%d 打印十进制的有符号整数
//	//%u 打印十进制的无符号整数
//	return 0;
//}


//4.
//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100	-20的补码
//	//00000000000000000000000000001010	10的补码
//	//11111111111111111111111111110110	运算后的补码
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010	输出的源码
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	//-10
//	//按照补码的形式进行运算，最后格式化成为有符号整数
//	return 0;
//}


//5.
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}
//结果为死循环 
//i为无符号整形 当i--变为负数时 负数的符号位变为无符号位 i变成超大的数字


//6.
//int main()
//{
//	//有符号字符型数组 范围：-128到127
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//		//-1 -2 -3 ...... -128 127 126 ...... 3 2 1 0
//	}
//	printf("%d", strlen(a));//求字符串长度 碰见\0或0结束
//	//128+127=255
//	return 0;
//}

//7.
//unsigned char i = 0;//无符号字符型 范围：0-255
//int main()
//{
//	//i最大为255 条件恒成立 死循环					
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}


//浮点型在内存中的存储
int main()
{
	int n = 9;
	//00000000000000000000000000001001	补码
	//0 00000000 00000000000000000001001
	//(-1)^0 * 0.00000000000000000001001 * 2^-126
	float* pFloat = (float*)&n;//把(int*)型 n 强制转化为(float*)型
	printf("n的值为：%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//0.000000



	*pFloat = 9.0;
	//1001.0	二进制
	//(-1)^0 * 1.001 * 2^3		3+127=130 转为二进制 10000010
	//0 10000010 00100000000000000000000
	//01000001000100000000000000000000	补码
	printf("num的值为：%d\n", n);//以整形打印 1091567616
	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
	return 0;
}

//例：float f = 5.5;
//5.5		十进制
//101.1		二进制
//(-1)^0 * 1.011 * 2^2	2+127=129 转成二进制 10000001
//0 10000001 01100000000000000000000	浮点型在内存中存储
//0100 0000 1011 0000 0000 0000 0000 0000	二进制
//0x40b00000	十六进制存储